# 4.6 - Remaining Exercise Steps (3-7)

In [38]:
# Importing Libraries
import pandas as pd
import numpy as np
import os

## Importing Data Sets

In [39]:
# Creating a Path
path = r'C:\Users\Ivan Dimitrov\OneDrive\Documents\13-06-2023 Instacart Basket Analysis'
# Importing Products Data Set
df_prods =  pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_cleaned.csv'), index_col = False)

### Step 3: In a new notebook, import the orders_products_combined dataframe from the pickle file you just saved.

In [40]:
# Importing Pickle Data Set ("orders_products_combined")
df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

### Step 4 Check the shape of the imported dataframe (it should be the same as the one you exportedâ€”always check!).

In [41]:
# Checking Shape
df_ords_prods_combined.shape

(32434489, 10)

### Step 5: Merge "orders_products_combined" dataframe with your products data set.

In [42]:
# Checking Columns of "orders_products_combined"
df_ords_prods_combined.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_time_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', '_merge'],
      dtype='object')

In [43]:
# Dropping the "_merge" column as we will get a new one
df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['_merge'])

In [44]:
# Checking the types of the columns and Memory Usage
df_ords_prods_combined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434489 entries, 0 to 32434488
Data columns (total 9 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int8
 3   orders_day_of_week      int8
 4   order_time_of_day       int8
 5   days_since_prior_order  float16
 6   product_id              int32
 7   add_to_cart_order       int32
 8   reordered               int8
dtypes: float16(1), int32(4), int8(4)
memory usage: 928.0 MB

In [45]:
# Checking Columns of "df_prods"
df_prods.columns

Index(['Unnamed: 0', 'product_id', 'product_name', 'aisle_id', 'department_id',
       'prices'],
      dtype='object')

In [46]:
# Dropping the "Unnamed: 0" Column
df_prods.drop(columns = {'Unnamed: 0'}, inplace = True)

In [47]:
# Checking Columns again
df_prods.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices'], dtype='object')

In [48]:
# Checking the types of the columns and Memory Usage
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int64
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int64
 3   department_id  49672 non-null  int64
 4   prices         49672 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.9+ MB

In [49]:
# Change types for df_prods so that we minimize the Memory Usage

df_prods['product_id']=df_prods['product_id'].astype('int32')
df_prods['aisle_id'] = df_prods['aisle_id'].astype('int32')
df_prods['department_id']=df_prods['department_id'].astype('int8')
df_prods['prices']=df_prods['prices'].astype('float16')

In [50]:
# Check output to see memory usage
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int32
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int32
 3   department_id  49672 non-null  int8
 4   prices         49672 non-null  float16
dtypes: float16(1), int32(2), int8(1), object(1)
memory usage: 921.8+ KB

In [52]:
# Checking Column Names visually in both files
df_ords_prods_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [53]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.800781
1,2,All-Seasons Salt,104,13,9.296875
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.500000
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.500000
4,5,Green Chile Anytime Sauce,5,13,4.300781

In [54]:
# Merging "df_ords_prods_combined"  with "df_prods", using (product_id) as a key because it matches in both data sets
df_merged = df_ords_prods_combined.merge(df_prods, on = 'product_id', indicator = True)

In [55]:
# Checking the merged file
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

### Step 6: Confirm the results of the merge using the merge flag.

In [56]:
# Checking the merge using a merge flag
df_merged['_merge'].value_counts(dropna = False)

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [57]:
# Checking the Shape
df_merged.shape

(32404859, 14)

### Step 7: Export the newly created dataframe as orders_products_merged in a suitable format (taking into consideration the size).

In [58]:
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))